;______________ Опоры AutoCAD 2004 Version Begin- 21/11/03  ___________________




;*********************************************************************************
;                              Класс Опоры
;*********************************************************************************
;[][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][]
(Порядок-Наследования: '$-Опоры nil

);end Порядок-Наследования

;[][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][]

(Класс '$-Опоры '(
;_________________________________________________________________________________
(Новый ( ;Инициализация класса обнуление переменных
         (defun DATA-IFF () t )
         (defun Новый ( )
	  	(setq Общая-Длина-Z-Компенсатора 0.0)
	  	t
          );end defun
));End Новый
;_________________________________________________________________________________
(Имя-Класса ( ;Инициализация класса обнуление переменных
         (defun DATA-IFF () t )
         (defun Имя-Класса ( )
              "Опоры"
          );end defun
));End
;_________________________________________________________________________________
(Чтение-Данных (
         (defun DATA-IFF () t )
         (defun Чтение-Данных ()
	  	t
          );end defun
));End
;_________________________________________________________________________________
(Обновлять-В-Точке-? ( ;Инициализация класса обнуление переменных
         (defun DATA-IFF () t )
         (defun Обновлять-В-Точке-? ( )
	      ;Проверяет признаки
              t
          );end defun
));End Новый
;_________________________________________________________________________________
(Расстановка-Опор (
         (defun DATA-IFF (  ) t	);end defun
         (defun Расстановка-Опор ( )
	      	;формируем образ схемы
	      	;Добавляем данные пользователя
	  
		( => 'Расстановка-Угловых-Опор 		nil)
	        ( => 'Расстановка-Неподвижных-Опор 	nil)
	        ( => 'Расстановка-Опор-Компенсаторов	nil)	      
	      	( => 'Расстановка-Основных-Опор 	nil)
	      
          );end defun
));End
;_________________________________________________________________________________
( Угол-Поворота-Трассы-Next  ( 
         (defun DATA-IFF (Индекс-Участка )(And (not (Null Индекс-Участка )) (>  Индекс-Участка 0 )))
         (defun  Угол-Поворота-Трассы-Next ( / Текущий-Участок-Next)
		(setq Текущий-Участок-Next Текущий-Участок )
			(setq Текущий-Участок (nth (+ Индекс-Участка  1) ##Общий-Список-Участков )
			      Угол-Поворота-Трассы-Next (=> 'Угол-Поворота-Трассы nil)
			);end setq
	      		
		(setq Текущий-Участок Текущий-Участок-Next )

	       Угол-Поворота-Трассы-Next
	 );end defun
));End
;_________________________________________________________________________________
( Направление-Угла-Next  ( 
         (defun DATA-IFF ( Индекс-Участка )(And (not (Null Индекс-Участка )) (>  Индекс-Участка 0 )))
         (defun  Направление-Угла-Next ( / Текущий-Участок-Next)
		(setq Текущий-Участок-Next Текущий-Участок )
			(setq Текущий-Участок (nth (+ Индекс-Участка  1) ##Общий-Список-Участков )
			      Направление-Угла-Next (=> 'Направление-Угла nil)
			);end setq
	      		
		(setq Текущий-Участок Текущий-Участок-Next )

	       Направление-Угла-Next
	 );end defun
));End
;_________________________________________________________________________________
(Смещение-Угловой-Опоры (
         (defun DATA-IFF ( )  t )
         (defun Смещение-Угловой-Опоры ( Коэф-Радиуса-Гнутья-Отводов Максимальный-Диаметр Расстояние-От-Сварки Максимальная-Длина-Опоры Угол-Поворота-Трассы-Next )
	      (/ (+ (* Коэф-Радиуса-Гнутья-Отводов Максимальный-Диаметр (tan (dtr  (/ Угол-Поворота-Трассы-Next 2)) )) Расстояние-От-Сварки (/  Максимальная-Длина-Опоры 2 ) 50 ) 1000.0)
          );end defun
));End
;_________________________________________________________________________________
(Расстановка-Угловых-Опор (
         (defun DATA-IFF ( Граничные-Условия Угол-Поворота-Трассы ) t)
	 (defun Расстановка-Угловых-Опор ( )
	  	(=> 'Расстановка-Угловых-Опор-Справа nil)
	  	(=> 'Расстановка-Угловых-Опор-Слева nil)	  	
          );end defun
));End
;_________________________________________________________________________________
(Расстановка-Угловых-Опор-Слева (
         (defun DATA-IFF ( Граничные-Условия Угол-Поворота-Трассы )
	      				(And  (Not (Null Текущий-Участок ))
				    		(= (car Граничные-Условия ) '#-Трасса-ВУ )
					      	(< Угол-Поворота-Трассы 74.0 ) ;Применяем опору под угол для углов поворота < 74.0 гр
					      	(> Угол-Поворота-Трассы 51.0 ) ;Угол начинает работать как компенсатор
					);end and
		);end defun
         (defun Расстановка-Угловых-Опор-Слева  ( Шаг-Основных-Опор Привязка-Трассы-Слева Привязка-Трассы-Справа Направление-Угла )

			;Направление-Угла R или L	     	
   			(setq Опора-2 (Кратность (* Шаг-Основных-Опор 0.86 ) 0.1))
	      
      			(if (= Направление-Угла "R")
	    			(progn
					(setq Смещ (/ Привязка-Трассы-Слева  ( tan (dtr Угол-Поворота-Трассы ))))
				);end progn
	    			(progn
					(setq Смещ (/ Привязка-Трассы-Справа ( tan (dtr Угол-Поворота-Трассы ))))
				);end progn
	 		);end if
	      
      			(Добавить-Опору ( - Опора-2  Смещ ) 'ОПОРА-Угловая )
		t
          );end defun
));End
;_________________________________________________________________________________
(Расстановка-Угловых-Опор-Справа (
         (defun DATA-IFF ( Граничные-Условия Угол-Поворота-Трассы-Next )
	      				(And  (Not (Null Текущий-Участок ))
				    		(= (cadr Граничные-Условия ) '#-Трасса-ВУ )
					      	(< Угол-Поворота-Трассы-Next 74.0 ) ;Применяем опору под угол для углов поворота < 74.0 гр
					      	(> Угол-Поворота-Трассы-Next 51.0 ) ;Угол начинает работать как компенсатор
					);end and
		);end defun
         (defun Расстановка-Угловых-Опор-Справа ( Длина-Участка Смещение-Угловой-Опоры Шаг-Основных-Опор Привязка-Трассы-Слева Привязка-Трассы-Справа Направление-Угла-Next )

		;Направление-Угла R или L
	      
		(Добавить-Опору  (/ (* (-  Длина-Участка  Смещение-Угловой-Опоры ) 1000.0 ) Mhx )  'ОПОРА-Угловая-Наклонная )
		(setq Опора-2 (Кратность (* Шаг-Основных-Опор 0.86 ) 0.1))
	      
		(if (= Направление-Угла-Next "R")
		    	(progn
				(setq Смещ (/ (* -1 Привязка-Трассы-Слева)  ( tan (dtr Угол-Поворота-Трассы-Next ))))
			);end progn
		    	(progn
				(setq Смещ (/ Привязка-Трассы-Справа ( tan (dtr Угол-Поворота-Трассы-Next ))))
			);end progn
		 );end if
	  
		(Добавить-Опору  (/ (* (+ (-  Длина-Участка Опора-2 ) Смещ ) 1000.0) Mhx ) 'ОПОРА-Угловая )
	  
		t
          );end defun
));End
;_________________________________________________________________________________
(Расстановка-Неподвижных-Опор (
         (defun DATA-IFF ( Длина-Участка Максимальный-Вылет Минимальный-Вылет Граничные-Условия  )
	      				(And  (Not (Null Текущий-Участок ))
				    		(= (car Граничные-Условия ) '#-Трасса-ВУ ) (= (cadr Граничные-Условия ) '#-Трасса-ВУ )
						(< (/  Длина-Участка Максимальный-Вылет ) 2.0 )
						(> (/  Длина-Участка Минимальный-Вылет  ) 2.0 )
					);end and
		);end defun
         (defun Расстановка-Неподвижных-Опор ( )
		;Делим участок неподвижной опорой по средине
	      	(Добавить-Опору (/ (* (/ Длина-Участка 2 ) 1000.0) Mhx) 'ОПОРА-Н )
	 	
	      	
		t
          );end defun
));End
;_________________________________________________________________________________
(Расстановка-Неподвижных-Опор (
          (defun DATA-IFF ( Длина-Участка Максимальный-Вылет Минимальный-Вылет Граничные-Условия  )
	      				 (And  (Not (Null Текущий-Участок ))
				    		(= (Car Граничные-Условия ) '#-Трасса-ВУ ) (= (cadr Граничные-Условия ) '#-Трасса-ВУ )
						(< (/  Длина-Участка Минимальный-Вылет  ) 2.0 )
					 );end and
			);end defun
         (defun Расстановка-Неподвижных-Опор ( )
	      	(setq Общая-Длина-Z-Компенсатора (+ Общая-Длина-Z-Компенсатора Длина-Участка))
	     	(if (> Общая-Длина-Z-Компенсатора Максимальный-Вылет)
		    	(progn
			     ;Делим участок неподвижной опорой по средине
			     (Добавить-Опору (/ (* (/ Длина-Участка 2 ) 1000.0) Mhx) 'ОПОРА-Н )
			     (setq Общая-Длина-Z-Компенсатора 0.0)
			 );end progn
		 );end if
	      
		;Участок считаем как Z образный компенсатор неподвижную опору не ставим
	      	;При расстановке угловых опор опоры добавляются на 2 участка.
		t
          );end defun
));End
;_________________________________________________________________________________
;|(Расстановка-Неподвижных-Опор (
         (defun DATA-IFF ( Длина-Участка Максимальный-Вылет Минимальный-Вылет Граничные-Условия  Шаг-Основных-Неподвижных-Опор)
	      				 (And  (Not (Null Текущий-Участок ))
				    		(= (Car Граничные-Условия ) '#-Трасса-ВУ ) (= (cadr Граничные-Условия ) '#-Трасса-ВУ )
					        (> (/  Длина-Участка Максимальный-Вылет ) 2.0 )
						(< (/ (-  Длина-Участка (* 2.0 Минимальный-Вылет ))  Шаг-Основных-Неподвижных-Опор  ) 0.396 )
					       ;  2*(k-Самокомпенсации =0.6*(1/3 пролета 0.67))=0.396
					 );end and
			);end defun
         (defun Расстановка-Неподвижных-Опор( )
	      	;Расставляем неподвижные опоры равномерно.
	      	(Добавить-Опору (/ (* Минимальный-Вылет 1000.0) Mhx) 'ОПОРА-Н )
	      	(Добавить-Опору (/ (* (- Длина-Участка Минимальный-Вылет) 1000.0) Mhx) 'ОПОРА-Н )
	      	(setq Длина-Участка (- 	Длина-Участка (* 2 Минимальный-Вылет )) )

	 
	      	(Разметка-Опор Минимальный-Вылет Длина-Участка Шаг-Основных-Неподвижных-Опор 'Опора-Н t t)
		t
          );end defun
));End
|;
;_________________________________________________________________________________
(Расстановка-Неподвижных-Опор (
         (defun DATA-IFF ( Длина-Участка Максимальный-Вылет Минимальный-Вылет Граничные-Условия  Шаг-Основных-Неподвижных-Опор)
	      				 (And  (Not (Null Текущий-Участок ))
				    		(= (Car Граничные-Условия ) '#-Трасса-ВУ ) (= (cadr Граничные-Условия ) '#-Трасса-ВУ )
					        (> (/  Длина-Участка Максимальный-Вылет ) 2.0 )
					 );end and
			);end defun
         (defun Расстановка-Неподвижных-Опор ( / Начальное-Смещение )
	      	;Расставляем неподвижные опоры равномерно уменьшая раастояние между ними
	      	;Если шаг кратный 2 -первая опора в центре иначе симметрично центра
	      	;Расставляем неподвижные опоры равномерно.
	  
		;L - kn
	  
	  	(Setq Кор-Вылет (Кратность (* (fix (/ Длина-Участка  Шаг-Основных-Неподвижных-Опор)) Шаг-Основных-Неподвижных-Опор ) 0.2 ))
	      	(if (and (> (- Длина-Участка Кор-Вылет) (* 2 Минимальный-Вылет)) (<= (- Длина-Участка  Кор-Вылет ) (* 2 Максимальный-Вылет) ))
			(progn
			 	;Учитываем смещение
			 	(setq Начальное-Смещение (- (/ Длина-Участка 2) (/ Кор-Вылет 2)))
			 	(Добавить-Опору (/ (* Начальное-Смещение 1000.0 ) Mhx ) 'ОПОРА-Н )
	      			(Добавить-Опору (/ (* (- Длина-Участка Начальное-Смещение) 1000.0 ) Mhx ) 'ОПОРА-Н )

			 	(Разметка-Опор Начальное-Смещение Кор-Вылет Шаг-Основных-Неподвижных-Опор 'Опора-Н t t)
			);end progn
		    	(progn
			 	(setq Начальное-Смещение Минимальный-Вылет)
	      			(Добавить-Опору (/ (* Минимальный-Вылет 1000.0) Mhx) 'ОПОРА-Н )
	      			(Добавить-Опору (/ (* (- Длина-Участка Минимальный-Вылет) 1000.0) Mhx) 'ОПОРА-Н )
			 
			 	(Разметка-Опор Начальное-Смещение (- Длина-Участка (* 2 Минимальный-Вылет )) Шаг-Основных-Неподвижных-Опор 'Опора-Н t t)
			);end progn
		);end if
	  
	      	t
          );end defun
));End
		  
;_________________________________________________________________________________
;|(Расстановка-Неподвижных-Опор (
         (defun DATA-IFF ( Длина-Участка Максимальный-Вылет Минимальный-Вылет Граничные-Условия  Шаг-Основных-Неподвижных-Опор)
	      				 (And  (Not (Null Текущий-Участок ))
				    		(= (Car Граничные-Условия ) '#-Трасса-ВУ ) (= (cadr Граничные-Условия ) '#-Трасса-ВУ )
					        (> (/  Длина-Участка Максимальный-Вылет ) 2.0 )
					        (> (/ (-  Длина-Участка (* 2.0 Минимальный-Вылет ))  Шаг-Основных-Неподвижных-Опор  ) 0.804 )
					       ;  2*(k-Самокомпенсации =0.6*(2/3 пролета 0.67))=0.804
					 );end and
			);end defun
         (defun Расстановка-Неподвижных-Опор ( / Начальное-Смещение )
	      	;Расставляем неподвижные опоры равномерно уменьшая раастояние между ними
	      	;Если шаг кратный 2 -первая опора в центре иначе симметрично центра
	      	;Расставляем неподвижные опоры равномерно.
	      	(if (>=	(Setq Кор-Вылет (Кратность (-  Длина-Участка
						    (* (fix (/ Длина-Участка  Шаг-Основных-Неподвижных-Опор)) Шаг-Основных-Неподвижных-Опор )) 0.2 ))
			(* 2 Минимальный-Вылет)
		    )
			(progn
			 	(setq Начальное-Смещение (/ Кор-Вылет 2))
	      			(Добавить-Опору (/ (* (/ Кор-Вылет 2) 1000.0 ) Mhx)'ОПОРА-Н )
	      			(Добавить-Опору (/ (* (- Длина-Участка (/ Кор-Вылет 2)) 1000.0 ) Mhx) 'ОПОРА-Н )
	      			(setq Длина-Участка (- 	Длина-Участка  Кор-Вылет ))
			);end progn
		    	(progn
			 	(setq Начальное-Смещение Максимальный-Вылет)
	      			(Добавить-Опору (/ (* Максимальный-Вылет 1000.0) Mhx) 'ОПОРА-Н )
	      			(Добавить-Опору (/ (* (- Длина-Участка Максимальный-Вылет) 1000.0) Mhx) 'ОПОРА-Н )
	      			(setq Длина-Участка (- 	Длина-Участка (* 2 Максимальный-Вылет )) )
			);end progn
		);end if

	      	(Разметка-Опор Начальное-Смещение Длина-Участка Шаг-Основных-Неподвижных-Опор 'Опора-Н t t)
	 
	      	t
          );end defun
));End		  
|;
;_________________________________________________________________________________
;[][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][]
));end

;_________________________________________________________________________________
(Defun Кратность ( Расстояние Величина  )
 
	      (* Величина (fix (/ Расстояние  Величина)))
)
;_________________________________________________________________________________
(Defun Добавить-Опору ( PX Тип-Опоры / Опоры Начало )
	;Текущий-Участок
     (if (= Тип-Опоры 'Опора-Н )(setq Общая-Длина-Z-Компенсатора 0.0))
     (setq Опоры  	(>> Текущий-Участок 'Опоры  )
	   Начало (car  (>> Текущий-Участок 'Начало ))
	   Опоры (cons (list 'Опора
			     	(list
				     (List 'Px (+ Начало Px))
				     (List 'Тип-Опоры  Тип-Опоры) ;Угловая, неподвижная , рядовая
				);end list
			)
		       Опоры
		 );end cons
     );end setq
     (Subst-Текущий-Участок (list 'Опоры Опоры))
);end defun
;_________________________________________________________________________________
(defun Разметка-Опор (Начальное-Смещение Расстояние Шаг-Основных-Опор Тип-Опоры Расставлять-Равномерно-? По-Краям-Опоры-? )
    ; Ву-Начало Ву-Конец
    ; расстояние принято на 5% больше с целью уменьшения запаса на границе шаг - расстояние при [ количестве шагов < 1 ]
   (if (and (not (NULL Расстояние )) (> (- Расстояние (* Расстояние 0.05 ))  Шаг-Основных-Опор) ) ;не последний участок;
       
	(progn 
		;Расстановка основных опор
	     	(if (not (Null Расставлять-Равномерно-?))
		    (progn
			 	(setq Шаг-Основных-Опор (Кратность (/ Расстояние (+ (fix (/ Расстояние Шаг-Основных-Опор)) 1)) 0.1))
		    );end progn
		);end if
		    
  		(setq Кол-Шагов  (fix (/ Расстояние Шаг-Основных-Опор))
		      Кратно-2  (if (= (* (fix (/ Кол-Шагов 2)) 2) Кол-Шагов) t nil)
		);end setq
	     	(if (Null  По-Краям-Опоры-? )
		    (progn
  			 (cond
				((and (= Кол-Шагов 0) (> Расстояние Шаг-Угловых-Опор))
			 		;угловой участок, длина участка больше максимального углового шага опор
			 		;расстановка
			 		(Добавить-Опору (/ Расстояние 2) Тип-Опоры)
			 	)
			 	((> Кол-Шагов 1)
				 	(setq i 0 Begin-Px (Кратность (- (/ Расстояние 2) (* (/ Кол-Шагов 2) Шаг-Основных-Опор)) 0.1 ))
		 		 	(while (<= i Кол-Шагов)
					 	(Добавить-Опору (/ (* (+ Начальное-Смещение  Begin-PX  (* i Шаг-Основных-Опор )) 1000.0) Mhx) Тип-Опоры )
					   (setq i ( + i 1 ))
					);end while
				)
			 );end cond
		   );end progn
		    (progn
  			 (cond
			 	((> Кол-Шагов 1)
				 	(setq i 1 Begin-Px (Кратность (- (/ Расстояние 2) (* (/ Кол-Шагов 2) Шаг-Основных-Опор)) 0.1 ))
		 		 	(while (< i Кол-Шагов)
					 	(Добавить-Опору (/ ( * (+ Начальное-Смещение  Begin-PX  (* i Шаг-Основных-Опор )) 1000.0 ) Mhx) Тип-Опоры )
					   (setq i ( + i 1 ))
					);end while
				)
			 );end cond
		    );end progn
		);end if
	 );end progn
    );end if
);end defun
;_________________________________________________________________________________